# language: ru

Функция: Индексация проекта.
    Как пользователь агента
    Я хочу индексировать текущую кодовую базу
    Чтобы выполнять семантический поиск по кодовой базе

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер указаны через cli.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И в директории нет папки и файлов с конфигурацией semantic_explorer
    И отсутсвует индекс проекта
    И в директирии или подпапках есть файлы с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    Тогда запускается индексация кодовой базы
    И пользователь видит шаги индексации
    И индексация кодовой базы завершается успешно
    И система готова к использованию

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер указаны в переменных окружения.
    [Индексация выполняется на основе параметров в переменных окружения и завершается успешно, создана конфигурация]

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер не указаны.
    [Система требует указать провайдер и модели]

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер указаны через cli и в переменных окружения.
    [Для индексации выбираются параметры указанные через cli]


Сценарий: Реиндексация существующего проекта с актуальным индексом.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И присутствует конфигурация semantic_explorer
    И индекс содержит актуальную информацию
    Когда пользователь запускает реиндексацию
    Тогда выполняется проверка индексации
    И отображается прогресс проверки индекса
    И система отвечает что индекс актуален

Сценарий: Реиндексация существующего проекта с устаревшим индексом.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И присутствует конфигурация semantic_explorer
    И индекс содержит устаревшую информацию
    Когда пользователь запускает реиндексацию
    Тогда выполняется проверка индексации
    И выполняется индексация изменённых и добавленных файлов
    И удаляются индексы удалённых файлов
    И пользователь видит шаги индексации
    И система отвечает что индекс актуален.

Сценарий: Реиндексация конкретных файлов или директории, есть конфигурация, есть корректный индекс, есть неиндексированные файлы.
    [Выполнена индексация всех указанных файлов (или всех файлов в директории и подпапках если указана директория), информация дополнена в существующий индекс]

Сценарий: Реиндексация конкретных файлов или директории, есть конфигурация, есть корректный индекс, файлы отсутсвуют.
    [Пользователю сообщается что файлы для индекса не обнаружены]

Сценарий: Реиндексация конкретных файлов или директории, есть конфигурация, есть корректный индекс, доступ к директории закрыт.
    [Пользователю сообщается что директория не доступная для чтения]

Сценарий: Реиндексация конкретных файлов или директории, есть конфигурация, есть корректный индекс, доступ ко всем или некоторым файлам закрыт или файлы не читаются.
    [Пользователю сообщается что файлы не доступны для чтения, откатывает индекс к предыдущей версии если он имеется]

Сценарий: Реиндексация существующего проекта, нет конфигурации, нет индекса.
    [Пользователю сообщается, что проект не индексирован и предлагается подсказка с командой по индексации]

Сценарий: Реиндексация существующего проекта, есть конфигурация, нет индекса.
    [Пользователю сообщается, что проект не индексирован и предлагается подсказка с командой по индексации]

Сценарий: Реиндексация существующего проекта, нет конфигурации, есть индекс.
    [Пользователю сообщается об отсутствии конфигурации и предлагается подсказка с командой по индексации]



Сценарий: Запуск индексации, есть конфигурация, есть индекс, запуск без force параметра.
    [Система предупреждает пользователя, что есть индекс и даёт подсказку команды для реиндексации]

Сценарий: Запуск индексации, есть конфигурация, есть индекс, есть файлы для индекса, запуск с force параметром.
    [Выполнена полная успешная индексация проекта, удалён старый индекс]

Сценарий: Запуск индексации, есть конфигурация, нет индекса, есть файлы для индекса.
    [Выполнена индексация проекта]

Сценарий: Запуск индексации, всё что нужно для запуска индексации есть, нет файлов для индексации.
    [Система сообщает пользователю что нет файлов для индексации]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, провайдер не доступен.
    [Система сообщает о недоступности провайдера и указывает причину, по которой не смогла соединиться]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, получена рантайм ошибка связанная с моделью.
    [Система сообщает об ошибке работы модели, сообщает какая ошибка и останавливает индексацию, откатывает индекс к предыдущей версии если он имеется]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, получена рантайм ошибка связанная с работой с бд.
    [Система сообщает об ошибке работы с бд, сообщает какая ошибка и останавливает индексацию, откатывает индекс к предыдущей версии если он имеется]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, получена рантайм ошибка связанная с доступом к файлу или директории.
    [Система сообщает об ошибке работы с файлом или директорией, уточняет причину, останавливает индексацию, откатывает индекс к предыдущей версии если он имеется]

Сценарий: Запуск индексации, есть корректный индекс, нет конфигурации.
    [Пользователю сообщается об отсутствии конфигурации и предлагается построить новый индекс]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, есть предыдущая версия индекса, произошла ошибка останавливающая индексацию.
    [Система сообщает об ошибке во время индексации, сообщает какая ошибка и останавливает индексацию, откатывает весь индекс к предыдущей версии]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, есть предыдущая версия индекса, произошла ошибка НЕ останавливающая индексацию.
    [Индексация завершается успешно, пользователю сообщается какие ошибки произошли и почему, предлагается заменить старую версию индекса новой,
     если пользователь соглашается то старая версия затирается новой, если нет изменения откатываются к старой версии]


Сценарий: Удаление semantic_explorer из проекта.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    Когда пользователь вызывает команду удаления индекса
    Тогда выполняется удаление всего индекса
    И удаление папки с конфигурацией semantic_explorer и базой данных индекса.

Сценарий: Очистка индекса проекта.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    Когда пользователь вызывает команду очистки индекса
    Тогда выполняется очистка всей базы данных индекса.


Сценарий: Попытка операций индексации, реиндексации или запросов к ситеме во время индексации.
    [Доступ к репозиторию заблокирован до завершения индексации, при запросе к такому репозиторию запрашивающий процесс получит сообщение о блокировке.]


Сценарий: Запрос к репозиторию B во времявыполнения операции с репозиторием А.
    [Операция выполняется успешно (репозитории никак не связаны, система обрабатывает их параллельно)]

Сцунарий: Успешное завершение индексации.
    [Пользователь получил отчёт и результатах индексации, создана конфигурация индекса, создан индекс проекта,
    индекс проекта содержит всю семантическую и синтаксическую информацию о кодовой базе, в бд сохранены:
     - английский язык описаний;
     - сохранение источников;
     - метаданные актуальности;
     - пригодность данных для семантического и полнотекстового поиска.]
