# language: ru

Функция: Индексация проекта.
    Как пользователь агента
    Я хочу индексировать текущую кодовую базу
    Чтобы выполнять семантический поиск по кодовой базе

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер указаны через cli.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И в директории нет папки и файлов с конфигурацией semantic_explorer
    И отсутсвует индекс проекта
    И в директирии или подпапках есть файлы с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    Тогда запускается индексация кодовой базы
    И пользователь видит шаги индексации
    И индексация кодовой базы завершается успешно.

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер указаны в переменных окружения.
    [Индексация выполняется на основе параметров в переменных окружения и завершается успешно]

Сценарий: Первый запуск, чистая индексация, есть файлы для индекса, модели LLM и провайдер не указаны.
    [Система требует указать провайдер и модели]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, провайдер не доступен.
    [Система сообщает о недоступности провайдера и указывает причину, по которой не смогла соединиться]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, рантайм ошибка связанная с моделью.
    [Система сообщает об ошибке работы модели, сообщает какая ошибка и останавливает индексацию, сохраняет то что проиндексировано успешно]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, рантайм ошибка связанная с работой с бд.
    [Система сообщает об ошибке работы с бд, сообщает какая ошибка и останавливает индексацию, сохраняет то что проиндексировано успешно]

Сценарий: Запуск индексации, есть конфигурация, есть файлы для индекса, рантайм ошибка связанная с доступом к файлу или директории.
    [Система сообщает об ошибке работы с файлом или директорией, уточняет причину, и продолжает индексацию остальных файлов]


Сценарий: Запуск индексации, есть конфигурация, есть индекс, запуск без force параметра.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И в директории есть файлы с конфигурацией semantic_explorer
    И есть индекс проекта
    И в директирии или подпапках есть файлы с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    И не указывает force параметр.
    Тогда система предупреждает пользователя, что есть существующий индекс
    И сообщает формат команды для реиндексации.



Драфт Сценарий: Реиндексация конкретных файлов.

Сценарий: Запуск индексации при наличии конфигурации semantic_explorer, но отсутствием индекса.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И в директории есть файлы с конфигурацией semantic_explorer
    Но нет индекса
    И в директирии или подпапках есть файлы с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    Тогда запускается индексация кодовой базы
    И пользователь видит шаги индексации
    И индексация кодовой базы завершается успешно.

Сценарий: Запуск индексации, при отсутствии файлов для индексации и отсутсвии конфигурации semantic_explorer.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    Но нет файлов конфигурации системы semantic_explorer
    И в директирии или подпапках нет файлов с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    Тогда создаются все необходимые конфигурации
    И пользователю сообщают что конфигурация создана
    И пользователю сообщают, что нет файлов для конфигурации.

Сценарий: Запуск индексации, при отсутствии файлов для индексации и наличии конфигурации semantic_explorer.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И есть файлы конфигурации системы semantic_explorer
    И в директирии или подпапках нет файлов с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    Тогда система сообщает пользователю, что есть индекс, но отсутствуют файлы
    И пользователю предлагают сбросить индекс на начальное значение.

Сценарий: Принудительная полная индексация.
    Дано пользователь открыл в cli директорию которую считает корневой для кодовой базы
    И в директирии или подпапках нет файлов с расширениями (набор расширений поддерживающимися индексатором)
    Когда пользователь запускает индексацию
    И указывает force параметр.
    Тогда выполняется удаление старого индексации кодовой базы если он присутствует
    И выполняется индексация кодовой базы
    И пользователь видит шаги индексации.

Сценарий: Запуск индексации при наличии порежденных файлов связанных с semantic_explorer.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    И информация в бд повреждена
    Когда пользователь запускает индексацию
    Тогда выполняется удаление старого индекса кодовой базы
    И выполняется индексация кодовой базы
    И пользователь видит шаги индексации.

Сценарий: Запуск индексации при недоступности индекса semantic_explorer.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    И конфигурация недоступна для чтения
    Когда пользователь запускает индексацию
    Тогда система сообщает причину по которой индексация недоступна.


Сценарий: Реиндексация существующего проекта с актуальным индексом.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    И индекс содержит актуальную информацию
    Когда пользователь запускает реиндексацию
    Тогда выполняется проверка индексации
    И система отвечает что индекс актуален

Сценарий: Реиндексация существующего проекта с устаревшим индексом.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    И индекс содержит устаревшую информацию
    Когда пользователь запускает реиндексацию
    Тогда выполняется проверка индексации
    И выполняется индексация изменённых и добавленных файлов
    И удаляются индексы удалённых файлов
    И пользователь видит шаги индексации.


Сценарий: Удаление индекса = удаление semantic_explorer из проекта.
    Дано пользователь открыл в cli директорию с индексированной кодовой базой
    И присутствует конфигурация semantic_explorer
    Когда пользователь вызывает команду удаления индекса
    Тогда выполняется удаление всего индекса
    И удаление папки с конфигурацией semantic_explorer и базой данных индекса.
